[
    {
        
        "latar": "Aplikasi ini adalah rekomendasi kursus online adalah solusi teknologi yang bertujuan untuk membantu pengguna menemukan kursus online yang sesuai dengan minat, tujuan, dan tingkat keterampilan mereka. Latar belakang dari perkembangan aplikasi semacam ini dapat dijelaskan sebagai berikut <br>1. Pertumbuhan E-learning: Pertumbuhan industri e-learning, terutama dalam beberapa tahun terakhir, telah menciptakan banyak kursus online yang berbeda. Banyak penyedia kursus online dan universitas memanfaatkan platform online untuk menyediakan akses ke beragam pelatihan dan pembelajaran<br>2. Kebutuhan Akses yang Mudah: Dengan berbagai macam kursus yang tersedia, pengguna memerlukan cara yang lebih efisien untuk menemukan kursus yang paling relevan dengan minat dan tujuan mereka. Inilah yang memicu pengembangan aplikasi rekomendasi.<br> 3. Teknologi Pembelajaran Mesin: Teknologi pembelajaran mesin (machine learning) telah semakin berkembang, memungkinkan pengembang untuk menciptakan algoritma cerdas yang dapat menganalisis preferensi pengguna dan memberikan rekomendasi yang lebih akurat.</br></br>.</br>:.",
        "tujuan": "1.Personalisasi: Aplikasi sistem rekomendasi kursus online bertujuan untuk memberikan pengalaman personal yang lebih baik kepada pengguna. Mereka menggunakan data pengguna, seperti preferensi, riwayat pencarian, tingkat keterampilan, dan minat, untuk memberikan rekomendasi kursus yang sesuai dengan profil masing-masing pengguna<br>Mempermudah Pencarian: Tujuan utama adalah mempermudah proses pencarian kursus online. Dengan beragamnya pilihan kursus yang tersedia, aplikasi ini membantu pengguna untuk menemukan kursus yang sesuai dengan kebutuhan mereka tanpa harus melalui pencarian yang melelahkan.<br>3.Peningkatan Keterlibatan Pengguna: Aplikasi rekomendasi juga bertujuan untuk meningkatkan keterlibatan pengguna dengan mempertimbangkan preferensi dan minat mereka. Pengguna yang mendapatkan rekomendasi yang tepat cenderung lebih terlibat dan puas.</br></br>" ,
        "manfaat": "1. Pengalaman pengguna dalam mencari resep yang lebih baik <br>2. Memberikan inovasi dalam dunia kuliner <br>3. Memberikan dukungan untuk pengembangan makanan yang lezat <br>3. Pengelolaan resep yang efisien <br>4. Kemudahan akses pada resep yang berkualitas tinggi",
        "landasan": "1. JavaScript Bahasa pemograman yang yang digunakan dalam pengembangan website agar lebih dinamis dan interaktif <br>2. Fiber Adalah kerangka kerja web yang Express yang dibangun di atas Fasthttp, mesin HTTP tercepat untuk Go.<br>3. RESTful API / REST API Merupakan implementasi dari API (Application Programming Interface). REST (Representional State Transfer) adalah suatu arsitektur metode komunikasi yang menggunakan protokol HTTP untuk pertukaran data dan metode ini sering diterapkan dalam pengembangan aplikasi.",
        "kesimpulan": "Dalam proposal ini, kami bertujuan untuk mengembangkan Aplikasi Resep Modern “Kitchped” yang akan memberikan manfaat signifikan bagi pengguna dan pengembang. Tujuan utama proyek ini adalah menggabungkan teknologi terkini, seperti JavaScript ES6+ untuk frontend dan Go Fiber untuk backend, dalam menciptakan pengalaman kuliner yang lebih baik. Dengan aplikasi ini, pengguna akan mendapatkan akses mudah ke resep berkualitas tinggi, dapat mengelola koleksi resep mereka dengan efisien. Di sisi lain, pengembang akan memiliki kesempatan untuk menguasai teknologi terbaru dalam pengembangan web, memperoleh pengalaman dalam merancang, mengembangkan, dan menguji aplikasi modern. Dengan potensi dampak yang besar, proyek ini diharapkan akan membawa inovasi dalam dunia kuliner, memudahkan akses ke resep berkualitas. Kesimpulannya, pengembangan Aplikasi Resep Modern ini memiliki tujuan yang jelas serta manfaat yang signifikan bagi pengembang maupun pengguna.",
        "anggota": "1. Bimo Arga Dewantoro<br> Npm : 1204058<br> Kelas: D4 Teknik Informatika 3C<br>2. Firda Yulianti<br> Npm : 1214058 <br> Kelas: D4 Teknik Informatika 3C"

    }
]
